<a href="https://colab.research.google.com/github/praveen310194/ML/blob/main/Decision_Tree.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
file=pd.read_csv('titanic_train.csv')
file.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [3]:
df=file.copy()
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [4]:
x=df.drop(['PassengerId','Survived'],axis=1)
y=df['Survived']

In [5]:
x.isnull().sum()

Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [19]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    891 non-null    int64
 1   Name      891 non-null    object
 2   Sex       891 non-null    object
 3   Age       891 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Ticket    891 non-null    object
 7   Fare      891 non-null    float64
 8   Cabin     891 non-null    object
 9   Embarked  889 non-null    object
dtypes: float64(2), int64(3), object(5)
memory usage: 69.7+ KB

In [9]:
x.shape

(891, 10)

In [16]:
x['Age'].fillna(x['Age'].mean(),inplace=True)

In [18]:
x['Cabin'].fillna(x['Cabin'].mode()[0],inplace=True)

In [21]:
x['Embarked'].fillna(x['Embarked'].mode()[0],inplace=True)

In [23]:
x.head()

   Pclass                                               Name  ...    Cabin  Embarked
0       3                            Braund, Mr. Owen Harris  ...  B96 B98         S
1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  ...      C85         C
2       3                             Heikkinen, Miss. Laina  ...  B96 B98         S
3       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  ...     C123         S
4       3                           Allen, Mr. William Henry  ...  B96 B98         S

[5 rows x 10 columns]

In [24]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [28]:
for i in x.columns:
  if x[i].dtype=='object':
    x[i]=le.fit_transform(x[i])

In [29]:
x.head()

   Pclass  Name  Sex   Age  SibSp  Parch  Ticket     Fare  Cabin  Embarked
0       3   108    1  22.0      1      0     523   7.2500     47         2
1       1   190    0  38.0      1      0     596  71.2833     81         0
2       3   353    0  26.0      0      0     669   7.9250     47         2
3       1   272    0  35.0      1      0      49  53.1000     55         2
4       3    15    1  35.0      0      0     472   8.0500     47         2

In [30]:
from sklearn.model_selection import train_test_split

In [31]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.25, random_state=42)

In [32]:
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [33]:
model

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [34]:
model.fit(x_train,y_train)
model.score(x_test,y_test)

0.7892376681614349

In [36]:
y_pred=model.predict(x_test)

In [37]:
from sklearn.metrics import accuracy_score

In [38]:
accuracy_score(y_test,y_pred)

0.7892376681614349

In [39]:
test_file=pd.read_csv('titanic_test.csv')

In [48]:
dfs=test_file.copy()
dfs.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [49]:
dfs.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [50]:
dfs['Fare'].fillna(dfs['Fare'].mean(),inplace=True)
dfs['Age'].fillna(dfs['Age'].mean(),inplace=True)
dfs['Cabin'].fillna(dfs['Cabin'].mode()[0],inplace=True)

In [51]:
dfs=dfs.drop('PassengerId',axis=1)

In [52]:
for i in dfs.columns:
  if dfs[i].dtype=='object':
    dfs[i]=le.fit_transform(dfs[i])

In [53]:
dfs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Name      418 non-null    int64
 2   Sex       418 non-null    int64
 3   Age       418 non-null    float64
 4   SibSp     418 non-null    int64
 5   Parch     418 non-null    int64
 6   Ticket    418 non-null    int64
 7   Fare      418 non-null    float64
 8   Cabin     418 non-null    int64
 9   Embarked  418 non-null    int64
dtypes: float64(2), int64(8)
memory usage: 32.8 KB

In [54]:
ys=model.predict(dfs)

In [56]:
test_file['Survived']=ys
test_file.head()

   PassengerId  Pclass  ... Embarked Survived
0          892       3  ...        Q        0
1          893       3  ...        S        1
2          894       2  ...        Q        0
3          895       3  ...        S        0
4          896       3  ...        S        1

[5 rows x 12 columns]